{
	"resume": {
		"user": {
			"name": "Richard Bailey",
			"links": {
					"github": "https://github.com/additiveinverse/",
					"twitter": "http://www.twitter.com/wallofknives",
					"portfolio": "http://www.additiveinverse.com"
			},
			"location": "King of Prussia, PA"
		},
		"mission": "I am a UX developer and designer with experience architecting user focused solutions and leading development teams in the execution of those initiatives. I have a solid understanding of user-centered application design, pragmatic coding practices. I have a soft spot for team building, mentoring, refactoring large codebases and UX/UI architecture.",
		"skills": "I have passion for usability, user focused design, information architecture, HTML5, CSS3, Jquery, and UI performance. Also, I like tools (Gruntjs, Bower, Powershell, Sublime text, Node, Wordpress, Drupal just to name a few).",
		"quote": "I having been building things I think are cool my entire life. For the last several years its been UX designing and UI implementation. If I could stop, I would. It's kind of a problem. Ok. its not REALLY a problem. And if I stop it will be when I'm dead.",
		"timeline": [
			{	"company" : "Ebay Enterprise",
				"position" : "Lead UX/UI developer",
				"start" : "August 2010",
				"end" : "Present",
				"projects" : [ "ralphlauren.co.uk",  "timberland.com", "petsmart.com" ],
				"description" : "I helped implement semantic, user-centered front end implementations for Petsmart, Radio Shack, GNC, Adidas, Ralph Lauren, and Timberland. I was involved in interviewing, mentoring and training new developers in web standards, modular CSS approaches and emerging browser technologies. I also led an internal tools and prototyping team utilizing a variety of technologies such as HTML5, CSS3, Responsive Web Design, Javascript, LESS, Gruntjs, Angularjs, Jstl, CakePHP."
			},
			{	"company" : "Additive Inverse",	
				"position" : "Founder / UI designer / UX architect",
				"start" : "July 2008",
				"end" : "January 2011",
				"projects" : [ "createdigitalmusic.com", "additiveinverse.com" ],	
				"description" : "I provided my clients an array of services including project planning, visual design, and rapid HTML, CSS, and JS based theme development for a variety of open source content management and ecommerce platforms (Drupal, Ubercart, CubeCart, Wordpress, and Textpattern)."
			},
			{	"company" : "Webcore Technologies",
				"position" : "UI/UX consultant",
				"start" : "April 2008",
				"end" : "April 2010",
				"projects" : [ "reallybigcanvas.com", "webcoreconsulting.com" ],
				"description" : "I provided Webcore with a number of Web development and consulting services including visual design, and HTML, CSS, JavaScript based theme development for a variety of CMS platforms and even broader base of clients."
			},
			{	"company" : "Pixeldust Interactive",
				"position" : "Front end developer",
				"start" : "June 2008",
				"end" : "October 2005",
				"projects" : [ "lammes.com", "bargainjill.com" ],
				"description" : "Focused largely on Wordpress theme development, I worked within a small team of cross discipline developers and designers to deliver dynamic web projects for a wide variety of clients and industries."
			}
		]	
	}
}