{
	"resume": {
		"user": {
			"name": "Richard Bailey",
			"links": {
					"github": "https://github.com/additiveinverse/",
					"twitter": "http://www.twitter.com/wallofknives",
					"portfolio": "http://www.additiveinverse.com"
			},
			"location": "King of Prussia, PA"
		},
		"mission": "I am a seasoned UX developer and designer with experience crafting user focused solutions. I live and die by user-centered application design and pragmatic coding practices. I have a soft spot for team building, mentoring, and UX/UI architecture.",
		"skills": "I have passion for user focused design, information architecture, UI performance, HTML5, CSS3 and Javascript. Also, I like tools like Gruntjs, Gulp, Bower, Powershell, Sublime text, Node, Wordpress, Drupal.",
		"quote": "I am obsessed with building things: Teams, UI, UX, lego robots, office supply sculptures, you name it. My sweet spot is somewhere between art, design and development. I'd love to wear bigger leadership pants. I suspect though, that I would miss getting my hands in the code.",
		"timeline": [
			{	"company" : "Ebay Enterprise",
				"position" : "Lead UX/UI developer",
				"start" : "August 2010",
				"end" : "Present",
				"projects" : [ "petsmart.com", "zales.com", "ralphlauren.co.uk" ],
				"description" : "I helped implement semantic, user-centered front end implementations for Petsmart, Radio Shack, GNC, Adidas, Ralph Lauren, and Timberland. I was involved in interviewing, mentoring and training new developers in web standards, modular CSS approaches and emerging browser technologies. I also led an internal tools and prototyping team utilizing a variety of technologies such as HTML5, CSS3, Responsive Web Design, Javascript, LESS, Gruntjs, Angularjs, jQuery/UI, Jstl, CakePHP."
			},
			{	"company" : "Additive Inverse",	
				"position" : "Founder / UI UX designer / UX architect",
				"start" : "July 2008",
				"end" : "January 2011",
				"projects" : [ "additiveinverse.com", "bistrobyronz.com", "camerontexas.net" ],	
				"description" : "I provided my clients an array of services including project planning, visual design, and rapid HTML, CSS, and JS based theme development for a variety of open source content management and ecommerce platforms (Drupal, Ubercart, CubeCart, Wordpress, and Textpattern)."
			},
			{	"company" : "Webcore Technologies",
				"position" : "UI/UX consultant",
				"start" : "April 2008",
				"end" : "April 2010",
				"projects" : [ "reallybigcanvas.com", "webcoreconsulting.com" ],
				"description" : "I provided Webcore with a number of Web development and consulting services including visual design, and HTML, CSS, JavaScript based theme development for a variety of CMS platforms and even broader base of clients."
			},
			{	"company" : "Pixeldust Interactive",
				"position" : "Front end developer",
				"start" : "June 2008",
				"end" : "October 2005",
				"projects" : [ "lammes.com", "bargainjill.com" ],
				"description" : "Focused largely on Wordpress theme development, I worked within a small team of cross discipline developers and designers to deliver dynamic web projects for a wide variety of clients and industries."
			}
		]	
	}
}