{
	"resume": {
		"user": {
			"name": "Richard Bailey",
			"description": "Designer / Developer",
			"links": {
				"github": "//github.com/additiveinverse/",
				"twitter": "//www.twitter.com/__proem__",
				"linkedin": "//www.linkedin.com/in/additiveinverse/"
			},
			"location": "King of Prussia, PA"
		},
		"samples": ["ggv2.png", "ggv1.png", "zchild-home.png", "zchild-settings.png", "zchild-blocked.png", "nn-bfs.png", "nn-exitintent.png", "proemland.png", "bb.png" ],
		"mission": "I am a seasoned UX developer and designer. I live and die by user-centered application design and pragmatic coding practices. I have a soft spot for team building, mentoring, and UX/UI architecture. I am a bit of a mad scientist.",
		"quote": "Developing people, process and products are my passion. I love working closer to the top of the stack. I've lead enterprise UI teams with a lean startup mentality. I've spent some time in the creative salt mines of an agency environment. I've had a couple years of leadership and UI architecture under my belt. I like what those things have done to my brain.",
		"skills": "I know my way around UX design principles, information architecture, and front end performance tuning. Using tools like Angular, Wordpress, CraftCMS, Grunt, Powershell, Sublime text; I've designed and built everything from marketing & ecommerce sites to mobile apps that consume Restful Api's. Most of all, I like solving problems.",
		"timeline": [
			{	"company": "Content Watch",
				"position": "Designer / Developer",
				"start": "July 2016",
				"end": "present",
				"projects": ["netnanny.com", "wezift.com"],
				"description": "I designed and developed new UX features with a focus on funnel optimization. I worked closely with stakeholders to develop information architecture, visual design and development strategies for a number marketing initiatives. I helped standardize workflow, estimation and deploy processes. Using adobe creative suite plus tools like uxpin, git, gulp, sass, and jquery I helped to make these projects not only brand focused, but compelling."
			},
			{	"company": "Brash Beers",
				"position": "Art Director / Designer",
				"start": "July 2013",
				"end": "present",
				"projects": "",
				"description": "I worked with the founder to establish brand identity and visual guidelines. I created art for all the packaging, glassware, as well as t-shirts and merchandise sold at the brewery."
			},
			{	"company" : "Ebay Enterprise",
				"position" : "Lead UX developer",
				"start" : "August 2010",
				"end" : "March 2016",
				"projects" : [ "petsmart.com", "zales.com", "ralphlauren.co.uk" ],
				"description" : "I helped implement semantic front end ecommerce solutions for Petsmart, Ralph Lauren, and Timberland. Additionally, I led an internal tools team who's primary mission was to design and build tools to reduce day to day developer pain points. Additionally, I was involved in setting code standards, instituting team workflows, and implementing user focused design and development approaches with an eye towards emerging browser technologies."
			},
			{	"company" : "Additive Inverse",
				"position" : "UI/UX designer & developer",
				"start" : "July 2008",
				"end" : "January 2011",
				"projects" : [ "additiveinverse.com", "bistrobyronz.com", "camerontexas.net" ],
				"description" : "I provided my agency clients with an array of services including project planning, visual design, user experience design, and front end development for a variety of open source content management and ecommerce platforms (Drupal, Wordpress, and Textpattern)."
			},
			{	"company" : "Pixeldust Interactive",
				"position" : "Front end developer",
				"start" : "June 2008",
				"end" : "October 2005",
				"projects" : [ "lammes.com", "bargainjill.com" ],
				"description" : "Focused largely on Wordpress theme development, I worked within a small team of cross discipline developers and designers to deliver dynamic web projects for a wide variety of clients and industries."
			}
		]
	}
}